import { nanoid } from 'nanoid';

export const products = [
  {
    id: nanoid(),
    type: 'pies',
    name: 'Мусовий торт “Манго-маракуйя”',
    tags: ['ніжний мус', 'ароматні манго та маракуйя'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 400,
    amountOfOrders: 310,
    imgUrl: 'mango',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Шоколадний торт з малиною',
    tags: ['шоколад', 'ароматна малина'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 500,
    descr: '',
    amountOfOrders: 90,
    imgUrl: 'chok',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Ківі-маракуйя”',
    tags: ['ніжний крем', 'ківі', 'маракуйя'],
    options: {
      type: '',
      weight: { title: '1.5 кг', value: 1.5 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 700,
    descr: '',
    amountOfOrders: 120,
    imgUrl: 'kiwi',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Снікерс”',
    tags: ['шоколад', 'горіхи'],
    options: {
      type: '',
      weight: { title: '3 кг', value: 3 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 450,
    descr: '',
    amountOfOrders: 200,
    imgUrl: 'snickers',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Наполеон”',
    tags: ['ніжний заварний крем', 'ароматні коржі', 'ягоди'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 500,
    descr: '',
    amountOfOrders: 80,
    imgUrl: 'napoleon',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Тіраміссу”',
    tags: ['ніжний заварний крем', 'ароматні коржі', 'шоколад'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 675,
    descr: '',
    amountOfOrders: 170,
    imgUrl: 'tiramisu',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Медовик”',
    tags: ['ніжний заварний крем', 'ароматні коржі', 'ягоди'],
    options: {
      type: '',
      weight: { title: '1.5 кг', value: 1.5 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 530,
    descr: '',
    amountOfOrders: 210,
    imgUrl: 'honey',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Вафельно-горіховий”',
    tags: ['ароматні коржі', 'горіхи'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 500,
    descr: '',
    amountOfOrders: 140,
    imgUrl: 'nuts',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
  {
    id: nanoid(),
    type: 'pies',
    name: 'Торт “Фісташка-малина”',
    tags: ['ніжний заварний крем', 'фісташки', 'малина'],
    options: {
      type: '',
      weight: { title: '2 кг', value: 2 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 675,
    descr: '',
    amountOfOrders: 190,
    imgUrl: 'pistachio',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },

  {
    id: nanoid(),
    type: 'cakes',
    name: 'Шоколадне тістечко брауні',
    tags: ['ніжний крем', 'шоколад'],
    options: {
      type: '',
      weight: { title: '3шт', value: 1 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 300,
    descr: '',
    amountInBox: 3,
    amountOfOrders: 300,
    imgUrl: 'browni',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },

  {
    id: nanoid(),
    type: 'shoo',
    name: 'Тістечка Шу”',
    tags: ['ніжний крем', 'ягідна начинка'],
    options: {
      type: '',
      weight: { title: '6шт', value: 1 },
      decor: { title: 'Без декору', value: 0 },
    },
    price: 400,
    descr: '',
    amountInBox: 6,
    amountOfOrders: 290,
    imgUrl: 'shoo',
    info: [
      {
        id: nanoid(),
        title: 'Опис',
        text: 'Ніжний десерт, який знайомий усім нам з дитинства. Ви маєте можливість замовити класичний торт без прикрас, або ж прикрасити його соковитими ягодами або карамеллю. Не відмовляйте собі у спокусі скуштувати “Наполеон”! Ви маєте можливість замовити торт без цукру, без глютену та без лактози. '
      },
      {
        id: nanoid(),
        title: 'Умови зберігання',
        text: 'Зберігати в холодильнику при температурі до +6°С не більше 3-х діб.'
      },
      {
        id: nanoid(),
        title: 'Доставка',
        text: 'Доставка здійснюється двома способами: 1. Самовивіз з Печерського р-ну м. Києва. 2. На таксі (за тарифами служби таксі)',
      }
    ]
  },
];